src/ocaml-json.org
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../res/style.css"/>
#+TITLE: 用OCaml写JSON解析器

* 写在前面

本文实际上补完『Real World OCaml』一书中的第16章。不同之处在于我们只使用标准库（而非Core），
同时只使用OCamlyacc（而非更现代的Menhir、因为用不着）。

本文描述仅作教学用途，即只是一个简单的解析器，不涉及ATD（即由JSON自动映射到OCaml类型），对Unicode的处理并不完善。

你只需要有最基础的OCaml开发环境即可，Opam不是必须的。你最好有OCaml相关语法知识，虽然没有我觉得也能看懂。

* 数据类型

我们首先需要为JSON中的每种数据类型在OCaml中作相应定义。创建~datatype.ml~文件，写入：

#+BEGIN_SRC ocaml
  type stt = [
    | `Integer of int
    | `Float of float
    | `Bool of bool
    | `String of string
    | `Array of stt list
    | `Object of (string * stt) list
    ]
#+END_SRC

即，我们分别定义了JSON中的整型数、浮点数、布尔值、字符串、数组（作为由~stt~中一个类型组成的列表）和对象
（作为由一个字符串及其对应的~stt~中一个类型组成的列表）。

* 定义解析器

这一步，我们需要创建解析器规范文件，用于描述文法。我使用文件名~parser.mly~，我们将会用OCamlyacc处理它。
规范文件分为两部分，使用~%%~分隔：第一部分主要用于初始化解析器，而后半部分则指定文法。

#+BEGIN_SRC ocaml
  %token <int> INT
  %token <float> FLOAT
  %token TRUE
  %token FALSE
  %token <string> STRING
  %token COLON
  %token COMMA
  %token LEFT_BRACK
  %token RIGHT_BRACK
  %token LEFT_BRACE
  %token RIGHT_BRACE
  %token EOF
#+END_SRC

上面我们描述了解析器会遇到的所有token，使用~%token <type> uid~的语法；其中~<type>~为可选，表示带有值的token。

#+BEGIN_SRC ocaml
  %type <Datatype.stt> decl
  %start decl
  %{ open Datatype %}
  %%
#+END_SRC

随后，我们确定文法分析的结果类型于一开始定义的一致，并且为了能在文法分析中使用这些类型，读入~datatype.ml~文件。
第一部分结束。

#+BEGIN_SRC ocaml
  decl:
    | expr EOF { $1 }
    ;
#+END_SRC

入口，将文件中所有（EOF之前的）内容交由~expr~，而词法分析的结果则为~expr~返回的结果：~$1~（~$2~则代表EOF）。

#+BEGIN_SRC ocaml
  expr:
    | NULL { Null }
    | INT { `Integer($1) }
    | FLOAT { `Float($1) }
    | TRUE { `Bool(true) }
    | FALSE { `Bool(false) }
    | STRING { `String($1) }
    | LEFT_BRACK array_fields RIGHT_BRACK { `Array($2) }
    | LEFT_BRACE object_fields RIGHT_BRACE { `Object($2) }
    ;
#+END_SRC

我们定义了在~expr~中如何解析：遇到整型数则返回类型为整型数的值，浮点数、字符串同理；遇到布尔值则分别返回真／假；
遇到由方括号界定的数组时则交由~array_fields~处理，并返回其结果，对象同理。

#+BEGIN_SRC ocaml
  object_fields:
    | rev_object_fields { List.rev($1) }
    ;
  rev_object_fields:
    | /* Null */ { [] }
    | rev_object_fields COMMA STRING COLON expr { ($3, $5) :: $1 }
    | STRING COLON expr { [($1, $3)] }
    ;
#+END_SRC

之所以对于~object_fields~的规则构造不符合直觉的左递归后逆置的下推自动机，是由于OCamlyacc会生成左递归解析器，
如此能够减少栈空间的占用。

而我们做的就是依次将最右边的一个对象压到列表里去，同时处理空对象的情况。需要注意的是第二部分的注释我们需要使用C的语法。

同理，我们有对于数组的规则。

#+BEGIN_SRC ocaml
  array_fields:
    | rev_array_fields { List.rev($1) }
    ;
  rev_array_fields:
    | /* Null */ { [] }
    | rev_array_fields COMMA expr { $3 :: $1 }
    | expr { [$1] }
    ;
#+END_SRC

