cnt/ocaml-json.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta name="generator" content=
"HTML Tidy for HTML5 for Apple macOS version 5.8.0">
<!-- 2024-10-15 Tue 08:07 -->
<meta charset="utf-8">
<meta name="viewport" content=
"width=device-width, initial-scale=1">
<title>用OCaml写JSON解析器</title>
<meta name="author" content="RadioNoiseE">
<meta name="generator" content="Org Mode">
<link rel="stylesheet" type="text/css" href="../res/style.css">
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">用OCaml写JSON解析器</h1>
</header>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org93e836f">1. 写在前面</a></li>
<li><a href="#org7728f05">2. 数据类型</a></li>
<li><a href="#org3ee0ae0">3. 定义解析器</a></li>
<li><a href="#org0de81b2">4. 词法分析</a></li>
<li><a href="#org174b675">5. 集成</a></li>
<li><a href="#org2397fe5">6. 使用</a></li>
<li><a href="#orgb02b00c">7. 最后</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org93e836f" class="outline-2">
<h2 id="org93e836f"><span class="section-number-2">1.</span>
写在前面</h2>
<div class="outline-text-2" id="text-1">
<p>本文实际上补完『Real World
OCaml』一书中的第16章。不同之处在于我们只使用标准库（而非Core），同时只使用OCamlyacc（而非更现代的Menhir、因为用不着）。</p>
<p>
本文描述仅作教学用途，即只是一个简单的解析器，不涉及ATD（即由JSON自动映射到OCaml类型），对Unicode的处理并不完善。</p>
<p>你只需要有最基础的OCaml开发环境即可，Opam不是必须的。你最好有OCaml相关语法知识，虽然没有我觉得也能看懂。</p>
</div>
</div>
<div id="outline-container-org7728f05" class="outline-2">
<h2 id="org7728f05"><span class="section-number-2">2.</span>
数据类型</h2>
<div class="outline-text-2" id="text-2">
<p>
我们首先需要为JSON中的每种数据类型在OCaml中作相应定义。创建<code>datatype.ml</code>文件，写入：</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style=
"color: #a020f0;">type</span> <span style=
"color: #228b22;">stt</span> = [
  | <span style="color: #483d8b;">`Integer</span> <span style=
"color: #a020f0;">of</span> <span style=
"color: #483d8b;">int</span>
  | <span style="color: #483d8b;">`Float</span> <span style=
"color: #a020f0;">of</span> <span style=
"color: #483d8b;">float</span>
  | <span style="color: #483d8b;">`Bool</span> <span style=
"color: #a020f0;">of</span> <span style=
"color: #483d8b;">bool</span>
  | <span style="color: #483d8b;">`String</span> <span style=
"color: #a020f0;">of</span> <span style=
"color: #483d8b;">string</span>
  | <span style="color: #483d8b;">`Array</span> <span style=
"color: #a020f0;">of</span> <span style=
"color: #228b22;">stt</span> <span style=
"color: #483d8b;">list</span>
  | <span style="color: #483d8b;">`Object</span> <span style=
"color: #a020f0;">of</span> (<span style=
"color: #483d8b;">string</span> <span style=
"color: #a020f0;">*</span> <span style=
"color: #228b22;">stt</span>) <span style=
"color: #483d8b;">list</span>
  ]
</pre></div>
<p>
即，我们分别定义了JSON中的整型数、浮点数、布尔值、字符串、数组（作为由<code>stt</code>中一个类型组成的列表）和对象（作为由一个字符串及其对应的<code>stt</code>中一个类型组成的列表）。</p>
</div>
</div>
<div id="outline-container-org3ee0ae0" class="outline-2">
<h2 id="org3ee0ae0"><span class="section-number-2">3.</span>
定义解析器</h2>
<div class="outline-text-2" id="text-3">
<p>
这一步，我们需要创建解析器规范文件，用于描述文法。我使用文件名<code>parser.mly</code>，我们将会用OCamlyacc处理它。规范文件分为两部分，使用<code>%%</code>分隔：第一部分主要用于初始化解析器，而后半部分则指定文法。</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style=
"color: #a020f0;">%</span><span style=
"color: #a0522d;">token</span> <span style=
"color: #a020f0;">&lt;</span><span style=
"color: #a0522d;">int</span><span style=
"color: #a020f0;">&gt;</span> <span style=
"color: #483d8b;">INT</span>
<span style="color: #a020f0;">%</span><span style=
"color: #a0522d;">token</span> <span style=
"color: #a020f0;">&lt;</span><span style=
"color: #a0522d;">float</span><span style=
"color: #a020f0;">&gt;</span> <span style=
"color: #483d8b;">FLOAT</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">TRUE</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">FALSE</span>
<span style="color: #a020f0;">%</span><span style=
"color: #a0522d;">token</span> <span style=
"color: #a020f0;">&lt;</span><span style=
"color: #a0522d;">string</span><span style=
"color: #a020f0;">&gt;</span> <span style=
"color: #483d8b;">STRING</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">COLON</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">COMMA</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">LEFT_BRACK</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">RIGHT_BRACK</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">LEFT_BRACE</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">RIGHT_BRACE</span>
<span style="color: #a020f0;">%</span><span style=
"color: #0000ff;">token</span> <span style=
"color: #483d8b;">EOF</span>
</pre></div>
<p>上面我们描述了解析器会遇到的所有token，使用<code>%token &lt;type&gt;
uid</code>的语法；其中<code>&lt;type&gt;</code>为可选，表示带有值的token。</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style=
"color: #a020f0;">%</span><span style=
"color: #a020f0;">type</span> &lt;<span style=
"color: #228b22;">Datatype</span>.<span style=
"color: #228b22;">stt</span>&gt; decl
<span style="color: #a020f0;">%</span><span style=
"color: #483d8b;">start</span> decl
<span style="color: #a020f0;">%</span>{ open <span style=
"color: #483d8b;">Datatype</span> <span style=
"color: #a020f0;">%</span>}
<span style="color: #a020f0;">%%</span>
</pre></div>
<p>
随后，我们确定文法分析的结果类型于一开始定义的一致，并且为了能在文法分析中使用这些类型，读入<code>datatype.ml</code>文件。第一部分结束。</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style=
"color: #0000ff;">decl</span>:
  | <span style="color: #a0522d;">expr</span> <span style=
"color: #483d8b;">EOF</span> { <span style=
"color: #f0e68c;">$</span>1 }
  ;
</pre></div>
<p>
入口，将文件中所有（EOF之前的）内容交由<code>expr</code>，而词法分析的结果则为<code>expr</code>返回的结果：<code>$1</code>（<code>$2</code>则代表EOF）。</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style=
"color: #0000ff;">expr</span>:
  | <span style="color: #483d8b;">NULL</span> { <span style=
"color: #483d8b;">Null</span> }
  | INT { <span style=
"color: #483d8b;">`Integer</span>(<span style="color: #f0e68c;">$</span>1) }
  | FLOAT { <span style=
"color: #483d8b;">`Float</span>(<span style="color: #f0e68c;">$</span>1) }
  | TRUE { <span style="color: #483d8b;">`Bool</span>(<span style=
"color: #008b8b;">true</span>) }
  | FALSE { <span style="color: #483d8b;">`Bool</span>(<span style=
"color: #008b8b;">false</span>) }
  | STRING { <span style=
"color: #483d8b;">`String</span>(<span style=
"color: #f0e68c;">$</span>1) }
  | LEFT_BRACK array_fields RIGHT_BRACK { <span style=
"color: #483d8b;">`Array</span>(<span style=
"color: #f0e68c;">$</span>2) }
  | LEFT_BRACE object_fields RIGHT_BRACE { <span style=
"color: #483d8b;">`Object</span>(<span style=
"color: #f0e68c;">$</span>2) }
  ;
</pre></div>
<p>
我们定义了在<code>expr</code>中如何解析：遇到整型数则返回类型为整型数的值，浮点数、字符串同理；遇到布尔值则分别返回真／假；遇到由方括号界定的数组时则交由<code>array_fields</code>处理，并返回其结果，对象同理。</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style=
"color: #0000ff;">object_fields</span>:
  | <span style=
"color: #a0522d;">rev_object_fields</span> { <span style=
"color: #228b22;">List</span>.rev(<span style=
"color: #f0e68c;">$</span>1) }
  ;
rev_object_fields:
  | /<span style="color: #a020f0;">*</span> Null <span style=
"color: #a020f0;">*</span>/ { [] }
  | rev_object_fields COMMA STRING COLON expr { (<span style=
"color: #f0e68c;">$</span>3, <span style=
"color: #f0e68c;">$</span>5) <span style=
"color: #a020f0;">::</span> <span style=
"color: #f0e68c;">$</span>1 }
  | STRING COLON expr { [(<span style=
"color: #f0e68c;">$</span>1, <span style=
"color: #f0e68c;">$</span>3)] }
  ;
</pre></div>
<p>
之所以对于<code>object_fields</code>的规则构造不符合直觉的左递归后逆置的下推自动机，是由于OCamlyacc会生成左递归解析器，如此能够减少栈空间的占用。</p>
<p>而我们做的就是依次将最右边的一个对象压到列表里去，同时处理空对象的情况。需要注意的是第二部分的注释我们需要使用C的语法。</p>
<p>同理，我们有对于数组的规则。</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style=
"color: #0000ff;">array_fields</span>:
  | <span style=
"color: #a0522d;">rev_array_fields</span> { <span style=
"color: #228b22;">List</span>.rev(<span style=
"color: #f0e68c;">$</span>1) }
  ;
rev_array_fields:
  | /<span style="color: #a020f0;">*</span> Null <span style=
"color: #a020f0;">*</span>/ { [] }
  | rev_array_fields COMMA expr { <span style=
"color: #f0e68c;">$</span>3 <span style=
"color: #a020f0;">::</span> <span style=
"color: #f0e68c;">$</span>1 }
  | expr { [<span style="color: #f0e68c;">$</span>1] }
  ;
</pre></div>
</div>
</div>
